#### Terraform Plan 📋
```
Acquiring state lock. This may take a few moments...
data.alz_architecture.this: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wMzc5ZTM4Mi0xYTYwLTRkNDctYTg0MC1lZmViY2IxOGM1YmI7b2JqZWN0SWQ9NDhjNzkyNDUtMmM0ZS00MjE5LTllYjUtMTUzM2Q5ZDBiNjU0O3N1YnNjcmlwdGlvbklkPWJlYzgwYTFiLTdmMDQtNDYyZC05Mjk5LTE0OTEzOGVlMGU4YTt0ZW5hbnRJZD04OTE3ZWQzNS1mZjNlLTQ0YWMtYjcyZS1mZGJkM2VkM2E3ZmY=]
data.alz_architecture.this: Still reading... [10s elapsed]
data.alz_architecture.this: Still reading... [20s elapsed]
data.alz_architecture.this: Still reading... [30s elapsed]
data.alz_architecture.this: Still reading... [40s elapsed]
data.alz_architecture.this: Still reading... [50s elapsed]
data.alz_architecture.this: Read complete after 53s [id=alz_with_amba]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azapi_resource.alz_policy_assignments["alz-connectivity/Deploy-AMBA-Connectivity"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "This initiative deploys Azure Monitor Baseline Alerts (AMBA-ALZ) to monitor Network components such as Azure Firewalls, ExpressRoute, VPN, and Private DNS Zones."
              + displayName           = "Deploy Azure Monitor Baseline Alerts (AMBA-ALZ) for Connectivity - Part #1"
              + enforcementMode       = "Default"
              + metadata              = {
                  + _deployed_by_amba = true
                  + createdBy         = ""
                  + createdOn         = ""
                  + updatedBy         = ""
                  + updatedOn         = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "Alerting {enforcementMode} be deployed to Azure services."
                    },
                ]
              + notScopes             = []
              + overrides             = []
              + parameters            = {
                  + AFWSNATPortUtilizationPolicyEffect                = {
                      + value = "deployIfNotExists"
                    }
                  + ALZMonitorDisableTagName                          = {
                      + value = "MonitorDisable"
                    }
                  + ALZMonitorDisableTagValues                        = {
                      + value = [
                          + "true",
                          + "Test",
                          + "Dev",
                          + "Sandbox",
                        ]
                    }
                  + ALZMonitorResourceGroupLocation                   = {
                      + value = "japaneast"
                    }
                  + ALZMonitorResourceGroupName                       = {
                      + value = "rg-amba-alerts-japaneast"
                    }
                  + ALZMonitorResourceGroupTags                       = {
                      + value = {
                          + deployed_by = "terraform"
                          + environment = "production"
                          + managed_by  = "platform-team"
                        }
                    }
                  + ERCIRArpAvailabilityPolicyEffect                  = {
                      + value = "deployIfNotExists"
                    }
                  + ERCIRBgpAvailabilityPolicyEffect                  = {
                      + value = "deployIfNotExists"
                    }
                  + ERCIRQoSDropBitsinPerSecPolicyEffect              = {
                      + value = "deployIfNotExists"
                    }
                  + ERCIRQoSDropBitsoutPerSecPolicyEffect             = {
                      + value = "deployIfNotExists"
                    }
                  + ERGwExpressRouteBitsInPolicyEffect                = {
                      + value = "disabled"
                    }
                  + ERGwExpressRouteBitsOutPolicyEffect               = {
                      + value = "disabled"
                    }
                  + ERGwExpressRouteCpuUtilPolicyEffect               = {
                      + value = "deployIfNotExists"
                    }
                  + ERPBitsInPerSecondPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + ERPBitsOutPerSecondPolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                  + ERPLineProtocolPolicyEffect                       = {
                      + value = "deployIfNotExists"
                    }
                  + ERPRxLightLevelHighPolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                  + ERPRxLightLevelLowPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + ERPTxLightLevelHighPolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                  + ERPTxLightLevelLowPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + FirewallHealthPolicyEffect                        = {
                      + value = "deployIfNotExists"
                    }
                  + LBDatapathAvailabilityPolicyEffect                = {
                      + value = "deployIfNotExists"
                    }
                  + LBGlobalBackendAvailabilityPolicyEffect           = {
                      + value = "deployIfNotExists"
                    }
                  + LBHealthProbeStatusPolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                  + LBUsedSNATPortsPolicyEffect                       = {
                      + value = "deployIfNotExists"
                    }
                  + PDNSZCapacityUtilPolicyEffect                     = {
                      + value = "deployIfNotExists"
                    }
                  + PDNSZQueryVolumePolicyEffect                      = {
                      + value = "disabled"
                    }
                  + PDNSZRecordSetCapacityPolicyEffect                = {
                      + value = "deployIfNotExists"
                    }
                  + PDNSZRegistrationCapacityUtilPolicyEffect         = {
                      + value = "deployIfNotExists"
                    }
                  + PIPBytesInDDoSPolicyEffect                        = {
                      + value = "disabled"
                    }
                  + PIPDDoSAttackPolicyEffect                         = {
                      + value = "deployIfNotExists"
                    }
                  + PIPPacketsInDDoSPolicyEffect                      = {
                      + value = "disabled"
                    }
                  + PIPVIPAvailabilityPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + VNETDDOSAttackPolicyEffect                        = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWBandWidthUtilPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWEgressPolicyEffect                           = {
                      + value = "disabled"
                    }
                  + VPNGWIngressPolicyEffect                          = {
                      + value = "disabled"
                    }
                  + VPNGWTunnelEgressPacketDropCountPolicyEffect      = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWTunnelEgressPacketDropMismatchPolicyEffect   = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWTunnelIngressPacketDropCountPolicyEffect     = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWTunnelIngressPacketDropMismatchPolicyEffect  = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGwBGPPeerStatusPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwERCpuUtilPolicyEffect                       = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwExpressRouteBitsPerSecondPolicyEffect       = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelBWPolicyEffect                        = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelEgressPacketDropCountPolicyEffect     = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelEgressPacketDropMismatchPolicyEffect  = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelEgressPolicyEffect                    = {
                      + value = "disabled"
                    }
                  + VnetGwTunnelIngressPacketDropCountPolicyEffect    = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelIngressPacketDropMismatchPolicyEffect = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelIngressPolicyEffect                   = {
                      + value = "disabled"
                    }
                  + activityFWDeletePolicyEffect                      = {
                      + value = "deployIfNotExists"
                    }
                  + activityNSGDeletePolicyEffect                     = {
                      + value = "deployIfNotExists"
                    }
                  + activityUDRDeletePolicyEffect                     = {
                      + value = "deployIfNotExists"
                    }
                  + activityUDRRoutesDeletePolicyEffect               = {
                      + value = "deployIfNotExists"
                    }
                  + activityUDRUpdatePolicyEffect                     = {
                      + value = "deployIfNotExists"
                    }
                  + activityVPNGWDeletePolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                }
              + policyDefinitionId    = "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policySetDefinitions/Alerting-Connectivity"
              + resourceSelectors     = []
            }
        }
      + id                               = (known after apply)
      + ignore_casing                    = false
      + ignore_missing_property          = true
      + ignore_null_property             = false
      + location                         = "japaneast"
      + name                             = "Deploy-AMBA-Connectivity"
      + output                           = (known after apply)
      + parent_id                        = "/providers/Microsoft.Management/managementGroups/alz-connectivity"
      + replace_triggers_external_values = [
          + "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policySetDefinitions/Alerting-Connectivity",
          + "japaneast",
        ]
      + response_export_values           = []
      + retry                            = {
          + error_message_regex  = [
              + "out of scope",
              + "hierarchy",
              + "not found",
              + "NotFound",
              + "AuthorizationFailed",
            ]
          + interval_seconds     = 30
          + max_interval_seconds = 300
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled        = true
      + type                             = "Microsoft.Authorization/policyAssignments@2024-04-01"

      + identity {
          + identity_ids = []
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azapi_resource.alz_policy_assignments["alz-connectivity/Deploy-AMBAConnectivity2"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "This initiative deploys Azure Monitor Baseline Alerts (AMBA-ALZ) to monitor Network components such as Azure Firewalls, ExpressRoute, VPN, and Private DNS Zones."
              + displayName           = "Deploy Azure Monitor Baseline Alerts (AMBA-ALZ) for Connectivity - Part #2"
              + enforcementMode       = "Default"
              + metadata              = {
                  + _deployed_by_amba = true
                  + createdBy         = ""
                  + createdOn         = ""
                  + updatedBy         = ""
                  + updatedOn         = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "Alerting {enforcementMode} be deployed to Azure services."
                    },
                ]
              + notScopes             = []
              + overrides             = []
              + parameters            = {
                  + AFWApplicationRuleHitPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + AFWNetworkRuleHitPolicyEffect                        = {
                      + value = "deployIfNotExists"
                    }
                  + ALZMonitorDisableTagName                             = {
                      + value = "MonitorDisable"
                    }
                  + ALZMonitorDisableTagValues                           = {
                      + value = [
                          + "true",
                          + "Test",
                          + "Dev",
                          + "Sandbox",
                        ]
                    }
                  + ERGwExpressRouteGatewayActiveFlowsPolicyEffect       = {
                      + value = "disabled"
                    }
                  + P2SVPNGatewaysP2SBandwidthPolicyEffect               = {
                      + value = "deployIfNotExists"
                    }
                  + P2SVPNGatewaysP2SConnectionCountPolicyEffect         = {
                      + value = "deployIfNotExists"
                    }
                  + P2SVPNGatewaysUserVpnRouteCountPolicyEffect          = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsBgpPeerStatusPolicyEffect                 = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsCountOfRoutesAdvertisedToPeerPolicyEffect = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsCountOfRoutesLearnedFromPeerPolicyEffect  = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsRoutingInfrastructureUnitsPolicyEffect    = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsSpokeVMUtilizationPolicyEffect            = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsVirtualHubDataProcessedPolicyEffect       = {
                      + value = "deployIfNotExists"
                    }
                }
              + policyDefinitionId    = "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policySetDefinitions/Alerting-Connectivity-2"
              + resourceSelectors     = []
            }
        }
      + id                               = (known after apply)
      + ignore_casing                    = false
      + ignore_missing_property          = true
      + ignore_null_property             = false
      + location                         = "japaneast"
      + name                             = "Deploy-AMBAConnectivity2"
      + output                           = (known after apply)
      + parent_id                        = "/providers/Microsoft.Management/managementGroups/alz-connectivity"
      + replace_triggers_external_values = [
          + "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policySetDefinitions/Alerting-Connectivity-2",
          + "japaneast",
        ]
      + response_export_values           = []
      + retry                            = {
          + error_message_regex  = [
              + "out of scope",
              + "hierarchy",
              + "not found",
              + "NotFound",
              + "AuthorizationFailed",
            ]
          + interval_seconds     = 30
          + max_interval_seconds = 300
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled        = true
      + type                             = "Microsoft.Authorization/policyAssignments@2024-04-01"

      + identity {
          + identity_ids = []
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azapi_resource.alz_policy_assignments["alz-corp/Audit-PeDnsZones"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "Audits the deployment of Private Link Private DNS Zone resources in the Corp landing zone."
              + displayName           = "Audit Private Link Private DNS Zone resources"
              + enforcementMode       = "Default"
              + metadata              = {
                  + createdBy = ""
                  + createdOn = ""
                  + updatedBy = ""
                  + updatedOn = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "Private Link Private DNS Zone resources {enforcementMode} be deployed in the Corp landing zone."
                    },
                ]
              + notScopes             = []
              + overrides             = []
              + parameters            = {
                  + effect              = {
                      + value = "Audit"
                    }
                  + privateLinkDnsZones = {
                      + value = [
                          + "privatelink.adf.azure.com",
                          + "privatelink.afs.azure.net",
                          + "privatelink.agentsvc.azure-automation.net",
                          + "privatelink.analysis.windows.net",
                          + "privatelink.api.azureml.ms",
                          + "privatelink.azconfig.io",
                          + "privatelink.azure-api.net",
                          + "privatelink.azure-automation.net",
                          + "privatelink.azurecr.io",
                          + "privatelink.azure-devices.net",
                          + "privatelink.azure-devices-provisioning.net",
                          + "privatelink.azuredatabricks.net",
                          + "privatelink.azurehdinsight.net",
                          + "privatelink.azurehealthcareapis.com",
                          + "privatelink.azurestaticapps.net",
                          + "privatelink.azuresynapse.net",
                          + "privatelink.azurewebsites.net",
                          + "privatelink.batch.azure.com",
                          + "privatelink.blob.core.windows.net",
                          + "privatelink.cassandra.cosmos.azure.com",
                          + "privatelink.cognitiveservices.azure.com",
                          + "privatelink.database.windows.net",
                          + "privatelink.datafactory.azure.net",
                          + "privatelink.dev.azuresynapse.net",
                          + "privatelink.dfs.core.windows.net",
                          + "privatelink.dicom.azurehealthcareapis.com",
                          + "privatelink.digitaltwins.azure.net",
                          + "privatelink.directline.botframework.com",
                          + "privatelink.documents.azure.com",
                          + "privatelink.eventgrid.azure.net",
                          + "privatelink.file.core.windows.net",
                          + "privatelink.gremlin.cosmos.azure.com",
                          + "privatelink.guestconfiguration.azure.com",
                          + "privatelink.his.arc.azure.com",
                          + "privatelink.kubernetesconfiguration.azure.com",
                          + "privatelink.managedhsm.azure.net",
                          + "privatelink.mariadb.database.azure.com",
                          + "privatelink.media.azure.net",
                          + "privatelink.mongo.cosmos.azure.com",
                          + "privatelink.monitor.azure.com",
                          + "privatelink.mysql.database.azure.com",
                          + "privatelink.notebooks.azure.net",
                          + "privatelink.ods.opinsights.azure.com",
                          + "privatelink.oms.opinsights.azure.com",
                          + "privatelink.pbidedicated.windows.net",
                          + "privatelink.postgres.database.azure.com",
                          + "privatelink.prod.migration.windowsazure.com",
                          + "privatelink.purview.azure.com",
                          + "privatelink.purviewstudio.azure.com",
                          + "privatelink.queue.core.windows.net",
                          + "privatelink.redis.cache.windows.net",
                          + "privatelink.redisenterprise.cache.azure.net",
                          + "privatelink.search.windows.net",
                          + "privatelink.service.signalr.net",
                          + "privatelink.servicebus.windows.net",
                          + "privatelink.siterecovery.windowsazure.com",
                          + "privatelink.sql.azuresynapse.net",
                          + "privatelink.table.core.windows.net",
                          + "privatelink.table.cosmos.azure.com",
                          + "privatelink.tip1.powerquery.microsoft.com",
                          + "privatelink.token.botframework.com",
                          + "privatelink.vaultcore.azure.net",
                          + "privatelink.web.core.windows.net",
                          + "privatelink.webpubsub.azure.com",
                        ]
                    }
                }
              + policyDefinitionId    = "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policyDefinitions/Audit-PrivateLinkDnsZones"
              + resourceSelectors     = []
            }
        }
      + id                               = (known after apply)
      + ignore_casing                    = false
      + ignore_missing_property          = true
      + ignore_null_property             = false
      + location                         = "japaneast"
      + name                             = "Audit-PeDnsZones"
      + output                           = (known after apply)
      + parent_id                        = "/providers/Microsoft.Management/managementGroups/alz-corp"
      + replace_triggers_external_values = [
          + "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policyDefinitions/Audit-PrivateLinkDnsZones",
          + "japaneast",
        ]
      + response_export_values           = []
      + retry                            = {
          + error_message_regex  = [
              + "out of scope",
              + "hierarchy",
              + "not found",
              + "NotFound",
              + "AuthorizationFailed",
            ]
          + interval_seconds     = 30
          + max_interval_seconds = 300
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled        = true
      + type                             = "Microsoft.Authorization/policyAssignments@2024-04-01"

      + identity {
          + identity_ids = []
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "None"
        }
    }

  # azapi_resource.alz_policy_assignments["alz-corp/Deny-HybridNetworking"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "Denies deployment of vWAN/ER/VPN gateway resources in the Corp landing zone."
              + displayName           = "Deny the deployment of vWAN/ER/VPN gateway resources"
              + enforcementMode       = "Default"
              + metadata              = {
                  + createdBy = ""
                  + createdOn = ""
                  + updatedBy = ""
                  + updatedOn = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "vWAN/ER/VPN gateway resources {enforcementMode} not be deployed in the Corp landing zone."
                    },
                ]
              + notScopes             = []
              + overrides             = []
              + parameters            = {
                  + effect                        = {
                      + value = "Deny"
                    }
                  + listOfResourceTypesNotAllowed = {
                      + value = [
                          + "microsoft.network/expressroutecircuits",
                          + "microsoft.network/expressroutegateways",
                          + "microsoft.network/expressrouteports",
                          + "microsoft.network/virtualwans",
                          + "microsoft.network/virtualhubs",
                          + "microsoft.network/vpngateways",
                          + "microsoft.network/p2svpngateways",
                          + "microsoft.network/vpnsites",
                          + "microsoft.network/virtualnetworkgateways",
                        ]
                    }
                }
              + policyDefinitionId    = "/providers/Microsoft.Authorization/policyDefinitions/6c112d4e-5bc7-47ae-a041-ea2d9dccd749"
              + resourceSelectors     = []
            }
        }
      + id                               = (known after apply)
      + ignore_casing                    = false
      + ignore_missing_property          = true
      + ignore_null_property             = false
      + location                         = "japaneast"
      + name                             = "Deny-HybridNetworking"
      + output                           = (known after apply)
      + parent_id                        = "/providers/Microsoft.Management/managementGroups/alz-corp"
      + replace_triggers_external_values = [
          + "/providers/Microsoft.Authorization/policyDefinitions/6c112d4e-5bc7-47ae-a041-ea2d9dccd749",
          + "japaneast",
        ]
      + response_export_values           = []
      + retry                            = {
          + error_message_regex  = [
              + "out of scope",
              + "hierarchy",
              + "not found",
              + "NotFound",
              + "AuthorizationFailed",
            ]
          + interval_seconds     = 30
          + max_interval_seconds = 300
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled        = true
      + type                             = "Microsoft.Authorization/policyAssignments@2024-04-01"

      + identity {
          + identity_ids = []
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "None"
        }
    }

  # azapi_resource.alz_policy_assignments["alz-corp/Deny-Public-Endpoints"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "This policy initiative is a group of policies that prevents creation of Azure PaaS services with exposed public endpoints"
              + displayName           = "Public network access should be disabled for PaaS services"
              + enforcementMode       = "Default"
              + metadata              = {
                  + createdBy = ""
                  + createdOn = ""
                  + updatedBy = ""
                  + updatedOn = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "Public network access {enforcementMode} be disabled for PaaS services."
                    },
                ]
              + notScopes             = []
              + overrides             = []
              + parameters            = {}
              + policyDefinitionId    = "/providers/Microsoft.Management/managementGroups/alz

... (truncated) ...

      = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.japaneast.azmk8s.io"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-japaneast-kusto-windows-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.japaneast.kusto.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-jpe-backup-windowsazure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.jpe.backup.windowsazure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-media-azure-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.media.azure.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-mongo-cosmos-azure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.mongo.cosmos.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-monitor-azure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.monitor.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-notebooks-azure-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.notebooks.azure.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-ods-opinsights-azure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.ods.opinsights.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-oms-opinsights-azure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.oms.opinsights.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-openai-azure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.openai.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-prod-migration-windowsazure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.prod.migration.windowsazure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-queue-core-windows-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.queue.core.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-redis-cache-windows-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-search-windows-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.search.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-service-signalr-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.service.signalr.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-servicebus-windows-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-siterecovery-windowsazure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.siterecovery.windowsazure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-sql-azuresynapse-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.sql.azuresynapse.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-table-core-windows-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.table.core.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-table-cosmos-azure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.table.cosmos.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-vaultcore-azure-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-web-core-windows-net-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.web.core.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-webpubsub-azure-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.webpubsub.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.private_link["privatelink-wvd-microsoft-com-primary"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_link" {
      + id                    = (known after apply)
      + name                  = "link-primary"
      + private_dns_zone_name = "privatelink.wvd.microsoft.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-dns-japaneast"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_public_ip.bastion["primary"] will be created
  + resource "azurerm_public_ip" "bastion" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "japaneast"
      + name                    = "pip-bastion-japaneast"
      + resource_group_name     = "rg-hub-japaneast"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_public_ip.er_gateway["primary"] will be created
  + resource "azurerm_public_ip" "er_gateway" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "japaneast"
      + name                    = "pip-ergw-hub-japaneast"
      + resource_group_name     = "rg-hub-japaneast"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_public_ip.firewall["primary"] will be created
  + resource "azurerm_public_ip" "firewall" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "japaneast"
      + name                    = "pip-fw-hub-japaneast"
      + resource_group_name     = "rg-hub-japaneast"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_resource_group.amba will be created
  + resource "azurerm_resource_group" "amba" {
      + id       = (known after apply)
      + location = "japaneast"
      + name     = "rg-amba-alerts-japaneast"
      + tags     = {
          + "SHAPolicy_RG"      = "true"
          + "_deployed_by_amba" = "true"
        }
    }

  # azurerm_resource_group.dns[0] will be created
  + resource "azurerm_resource_group" "dns" {
      + id       = (known after apply)
      + location = "japaneast"
      + name     = "rg-dns-japaneast"
      + tags     = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_resource_group.hub["primary"] will be created
  + resource "azurerm_resource_group" "hub" {
      + id       = (known after apply)
      + location = "japaneast"
      + name     = "rg-hub-japaneast"
      + tags     = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_resource_group.management will be created
  + resource "azurerm_resource_group" "management" {
      + id       = (known after apply)
      + location = "japaneast"
      + name     = "rg-management-japaneast"
      + tags     = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_route.gateway_to_vending["test-subscription-0"] will be created
  + resource "azurerm_route" "gateway_to_vending" {
      + address_prefix         = "10.200.0.0/16"
      + id                     = (known after apply)
      + name                   = "to-vnet-test-0"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-hub-japaneast"
      + route_table_name       = "rt-gateway-japaneast"
    }

  # azurerm_route_table.gateway["primary"] will be created
  + resource "azurerm_route_table" "gateway" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = "rt-gateway-japaneast"
      + resource_group_name           = "rg-hub-japaneast"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_route_table.spoke_to_firewall["primary"] will be created
  + resource "azurerm_route_table" "spoke_to_firewall" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "japaneast"
      + name                          = "rt-spoke-to-fw-japaneast"
      + resource_group_name           = "rg-hub-japaneast"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "default-to-firewall"
              + next_hop_in_ip_address = (known after apply)
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_subnet.bastion["primary"] will be created
  + resource "azurerm_subnet" "bastion" {
      + address_prefixes                              = [
          + "10.0.1.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"
    }

  # azurerm_subnet.dns_resolver_inbound["primary"] will be created
  + resource "azurerm_subnet" "dns_resolver_inbound" {
      + address_prefixes                              = [
          + "10.0.3.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "InboundEndpointSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"

      + delegation {
          + name = "Microsoft.Network.dnsResolvers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # azurerm_subnet.dns_resolver_outbound["primary"] will be created
  + resource "azurerm_subnet" "dns_resolver_outbound" {
      + address_prefixes                              = [
          + "10.0.4.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "OutboundEndpointSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"

      + delegation {
          + name = "Microsoft.Network.dnsResolvers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # azurerm_subnet.firewall["primary"] will be created
  + resource "azurerm_subnet" "firewall" {
      + address_prefixes                              = [
          + "10.0.2.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"
    }

  # azurerm_subnet.gateway["primary"] will be created
  + resource "azurerm_subnet" "gateway" {
      + address_prefixes                              = [
          + "10.0.0.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"
    }

  # azurerm_subnet_route_table_association.gateway["primary"] will be created
  + resource "azurerm_subnet_route_table_association" "gateway" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_user_assigned_identity.ama will be created
  + resource "azurerm_user_assigned_identity" "ama" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "uami-ama-japaneast"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-management-japaneast"
      + tags                = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.amba will be created
  + resource "azurerm_user_assigned_identity" "amba" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "uami-amba-japaneast"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-amba-alerts-japaneast"
      + tags                = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_virtual_network.hub["primary"] will be created
  + resource "azurerm_virtual_network" "hub" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "japaneast"
      + name                           = "vnet-hub-japaneast"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-hub-japaneast"
      + subnet                         = (known after apply)
      + tags                           = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_virtual_network_gateway.er["primary"] will be created
  + resource "azurerm_virtual_network_gateway" "er" {
      + active_active                         = (known after apply)
      + bgp_enabled                           = (known after apply)
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = (known after apply)
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "japaneast"
      + name                                  = "ergw-hub-japaneast"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "rg-hub-japaneast"
      + sku                                   = "Standard"
      + tags                                  = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
      + type                                  = "ExpressRoute"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + bgp_settings (known after apply)

      + ip_configuration {
          + name                          = "ergw-ipconfig"
          + private_ip_address_allocation = "Dynamic"
          + subnet_id                     = (known after apply)
        }
    }

  # time_sleep.wait_for_mg_rbac will be created
  + resource "time_sleep" "wait_for_mg_rbac" {
      + create_duration = "240s"
      + id              = (known after apply)
    }

  # time_sleep.wait_for_root_mg will be created
  + resource "time_sleep" "wait_for_root_mg" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

Plan: 946 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ama_identity_id              = (known after apply)
  + ama_identity_principal_id    = (known after apply)
  + dcr_vm_insights_id           = (known after apply)
  + er_circuit_ids               = {
      + primary = (known after apply)
    }
  + er_gateway_ids               = {
      + primary = (known after apply)
    }
  + firewall_private_ips         = {
      + primary = (known after apply)
    }
  + firewall_public_ips          = {
      + primary = (known after apply)
    }
  + gateway_route_table_ids      = {
      + primary = (known after apply)
    }
  + hub_virtual_network_ids      = {
      + primary = (known after apply)
    }
  + hub_virtual_network_names    = {
      + primary = "vnet-hub-japaneast"
    }
  + log_analytics_workspace_id   = (known after apply)
  + log_analytics_workspace_name = "law-management-japaneast"
  + management_group_ids         = {
      + connectivity   = (known after apply)
      + corp           = (known after apply)
      + decommissioned = (known after apply)
      + identity       = (known after apply)
      + landing_zones  = (known after apply)
      + management     = (known after apply)
      + online         = (known after apply)
      + platform       = (known after apply)
      + root           = (known after apply)
      + sandbox        = (known after apply)
      + security       = (known after apply)
    }
  + route_table_ids              = {
      + primary = (known after apply)
    }
  + vending_virtual_network_ids  = {
      + test-subscription = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
*Triggered by @shuhei0720*